Merge pull request #2 from stanko-dev/add-skills
docs: update README with badges, Mermaid diagrams;
